Revit 2024 API
GridNode Structure
A structure that represents a particular location in (U,V) from a grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public struct GridNode
Visual Basic
Public Structure GridNode
Visual C++
public value class GridNode
See Also
GridNode Members
Autodesk.Revit.DB Namespace